//consumption
#define m3_to_l  (0.27777777777777)
#define l_to_m3  (3.6)

int Ytray = 2; //положение курсора > на MMI

float consumption = 28.5; //m3/h расход 
float level = 524;  //УРОВЕНЬ В СМ
int tray_num = 1; //номер выбранного лотка

float c0 = 0.1407;
float expN = 1.55;

void f_calc_cons (void)
{
    consumption = c0 * pow(level,expN) * l_to_m3;
}

int num_tmp=0;
int max_count_tmp=0;

float Qmax = 30;  //расход вводимый вручную
float Qmin = 1;   //расход вводимый вручную

char *tray[]=
{                       //если элементов больше 11 поменять отображение в dos_win
"",                     
"Паршалла",             //1     Parshall
"RBC",                  //2     RBC
"Вентури",              //3     Venturi
"Без горловины",        //4     Cutthoat
"С тонк.стенкой",       //5     ThinWall
"Палмера-Боулюса",      //6     Palmer
"Монтана",              //7     Montana
"HS-типа",              //8     HS-type
"H-типа",               //9     H-type
"Треугольный",          //10    Triangle
"Трапециевидный",       //11    Trapezoid
};

int max_count_tray=(sizeof(tray)/sizeof(tray[0])) -1;

/*--------------Паршалла------------*/
char *Parshall_type[]=
{
"",
"П1-1",     //1
"П2-2",     //2
"П3-3",     //3
"П4-6",     //4
"П5-9",     //5
"П6-12",    //6
"П7-18",    //7
"П8-24",    //8
"П9-36",    //9
"П10-48",   //10
};
int max_count_Parshall=(sizeof(Parshall_type)/sizeof(Parshall_type[0])) -1;

float ParshallQmax[]=
{   //m3/h
0,
15.3,   //1
30.6,   //2
193.7,  //3
397.6,  //4
907.4,  //5
1641.4, //6
2508.0, //7
3374.6, //8
5138.4, //9
6922.5, //10
};

float ParshallQmin[]=
{   //m3/h
0,      
0.5,    //1
1.0,    //2
3.1,    //3
5.1,    //4
9.2,    //5
11.2,   //6
15.3,   //7
42.8,   //8
62.2,   //9
132.5,  //10
};

/*------------Вентури--------------------*/
char *Venturi_type[]=
{
"",
"В1",   //1
"В2",   //2
"В3",   //3
"В4",   //4
"В5",   //5
"В6",   //6
"В7",   //7
"В8",   //8
"В9",   //9
};
int max_count_Venturi=(sizeof(Venturi_type)/sizeof(Venturi_type[0])) -1;

float VenturiQmax[]=
{   //m3/h
0,
100,    //1
320,    //2
500,    //3
1250,   //4
4000,   //5
5000,   //6
8000,   //7
10000,  //8
20000,  //9
};

float VenturiQmin[]=
{   //m3/h
0,      
10,     //1
16,     //2
25,     //3
60,     //4
200,    //5
250,    //6
400,    //7
500,    //8
1000,   //9
};

/*------------RBC--------------------------*/
char *RBC_type[]=
{
"",
"Р1",     //1
"Р2",     //2
"Р3",     //3
"Р4",     //4
"Р5",     //5
};
int max_count_RBC=(sizeof(RBC_type)/sizeof(RBC_type[0])) -1;

float RBCQmax[]=
{   //л/с 
0,
1.432 * l_to_m3,  //1
4.265 * l_to_m3,  //2
8.155 * l_to_m3,  //3
24.31 * l_to_m3,  //4
49.08 * l_to_m3,  //5
};

float RBCQmin[]=
{   //л/с
0,      
0.0367 * l_to_m3,    //1
0.1042 * l_to_m3,    //2
0.4255 * l_to_m3,    //3
0.6175 * l_to_m3,    //4
0.0231 * l_to_m3,    //5
};
/*-----------------------------------------*/
/*--------------Без горловины------------*/
char *Cutthoat_type[]=
{
"",
"С1-1",     //1
"С1-2",     //2
"С1-3",     //3
"С1-4",     //4
"С2-1",     //5
"С2-2",    //6
"С2-3",    //7
"С2-4",    //8
"С3-1",    //9
"С3-2",    //10
"С3-3",    //11
"С3-4",    //12
};
int max_count_Cutthoat=(sizeof(Cutthoat_type)/sizeof(Cutthoat_type[0])) -1;

float CutthoatQmax[]=
{   //л/с
0,
3.152 * l_to_m3,  //1
6.043 * l_to_m3,  //2
12.6 * l_to_m3,   //3
25.71 * l_to_m3,  //4
20.36 * l_to_m3,  //5
41.32 * l_to_m3,  //6
84.11 * l_to_m3,  //7
171.11 * l_to_m3, //8
54.61 * l_to_m3,  //9
111.5 * l_to_m3,  //10
226.4 * l_to_m3,  //11
455.6 * l_to_m3,  //12
};

float CutthoatQmin[]=
{   //л/с
0,      
0.0223 * l_to_m3,     //1
0.0428 * l_to_m3,     //2
0.396 * l_to_m3,      //3
0.808 * l_to_m3,      //4
0.0822 * l_to_m3,     //5
0.5972 * l_to_m3,     //6
1.216 * l_to_m3,      //7
2.472 * l_to_m3,      //8
0.518 * l_to_m3,      //9
1.058 * l_to_m3,      //10
21.48 * l_to_m3,      //11
4.322 * l_to_m3,      //12
};